# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
# brew 'stripe'
brew 'svn' # Required for fonts
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Development
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'composer'
# brew 'imagemagick'
# brew 'libmemcached'
# brew 'memcached'
# brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask '1password-cli'
cask 'aerial'
cask 'alfred'
cask 'atom'
cask 'caffeine'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'github'
# cask 'google-backup-and-sync'
cask 'google-chrome'
# cask 'gpg-suite'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'notion'
cask 'phpstorm'
cask 'postman'
# cask 'screenflow'
cask 'sequel-ace'
# cask 'skype'
cask 'slack'
# cask 'steam'
# cask 'sublime-text'
# cask 'tableplus'
# cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
# cask 'transmission'
# cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store

mas 'Keynote', id: 409183694
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Microsoft To Do', id: 1274495053
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'SonicWall Mobile Connect', id: 822514576
# mas 'Spark', id: 1176895641
# mas 'Things', id: 904280696
mas 'Trello', id: 1278508951
mas 'Twitter', id: 1482454543
